// სავარჯიშო 1: თანამშრომლების ხელფასები
// შენ გაქვს კომპანია და გინდა შექმნა პროგრამა, რომელიც თანამშრომლების სახელფასო
// მონაცემებისა და ნამუშევარი დროის მიხედვით დაინგარიშებს ჯამურ ანაზღაურებას.
// ● ნამუშევარ საათებს ვითვლით ყოველდღიურად.
// ● თანამშრომელს ანაზღაურებს ვაძლევთ საათების მიხედვით.
// ● თუ ნამაშრომელმა იმუშავა დღეში 8-საათზე მეტი მაშინ ვუხდით ზეგანაკვეთურ
// ანაზღაურებას. ზეგანაკვეთური ანაზღაურება ერიცხება მხოლოდ იმ საათებზე რომელი
// 8-სამუშაო საათის მიღმაა. მაგალითად თუ იმუშავა 10 საათი, ზეგანაკვეთური
// ანაზღაურება ერიცხება 2-საათზე.
// ● თანამშრომლებს ზეგანაკვეთურ ნამუშევარ საათებში ვუხდით ხელფასის 125%-ს
// გარდა ჯამური ხელფასისა პროგრამამ უნდა გამოიტანოს იმ თანამშრომლების სია რომლებმაც
// ზეგანაკვეთურად იმუშავეს და მათთვის მისაცემი ანაზღაურება

public class employee
{

    public string FirstName { get; set; };
    public string SecondName { get; set;};
    public int ID { get; set; };
    public decimal Salary { get; set;};
    
}

internal class program
{



    public static void main()
    {
        list<employee> employees = new List<employee>();

        employees.add(new employee { FirstName = "Aleksandre", SecondName = 'Beruashvili', ID = '13001069578', Salary = 8500})
        employees.add(new employee { FirstName = "chichiko", SecondName = 'bendeliani', ID = '12312312312', Salary = 1500})
        employees.add(new employee { FirstName = "bichiko", SecondName = 'uturi', ID = '78978912312', Salary = 500})
        
        decimal employee_salary = 0m;
        int employee_worked_hours = 0;
        const int normal_working_hours = 8;
        const double overtime_percent = 1.25;

        foreach (var employee in employees)
        {
            System.Console.WriteLine(employee);
        }

    }
}





// სავარჯიშო 2: პროდუქციის მარაგის მართვა
// შენი კომპანია ყიდის პროდუქტებს და გჭირდება პროგრამა, რომელიც მართავს პროდუქციის
// ჩამონათვალს. პროდუქტს აქვს დასახელება, ფასი და რაოდენობა.
// პროგრამამ უნდა დაიანგარიშოს თითოეული პროდუქტის ჯამური ღირებულება, და ასევე
// პროდუქტების საერთო ღირებულება.
// სავარჯიშო 3: პროდუქციის გაყიდვების მართვა
// შენი კომპანია ყიდის პროდუქტებს. გვჭირდება პროგრამა რომელიც დაიანგარიშებს
// გაყიდვების სტატისტიკას.
// ● პროგრამა უნდა ითვლიდეს გაყიდვების ჯამურ ღირებულებას კვირის დღეების
// მიხედვით
// ● პროგრამა უნდა ითვლიდეს გაყიდვების საერთო მოცულობას კვირის ბოლოს.
// 04. კოლექციები და კლ…